alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F096_EX2_check_0_a.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "m400_gp_F096_EX2_check_0_a.h"
struct t_CheckData_m400_gp_F096_EX2_check_0_a __attribute__ ((section(".mali_data_check"))) CheckData_m400_gp_F096_EX2_check_0_a = {
/* unsigned int data_00002000[] = */
{
 0x40000000,0x400164d3,0x4002cd87,0x40043a28 /* 00002000 */
,0x4005aac4,0x40071f62,0x40089810,0x400a14d6 /* 00002010 */
,0x400b95c3,0x400d1ae0,0x400ea43a,0x401031dc /* 00002020 */
,0x4011c3d5,0x40135a2b,0x4014f4f0,0x4016942d /* 00002030 */
,0x401837f2,0x4019e046,0x401b8d3a,0x401d3ed9 /* 00002040 */
,0x401ef533,0x4020b051,0x40227044,0x40243515 /* 00002050 */
,0x4025fed7,0x4027cd93,0x4029a15c,0x402b7a3a /* 00002060 */
,0x402d583e,0x402f3b77,0x403123f6,0x403311c3 /* 00002070 */
,0x403504f4,0x4036fd91,0x4038fbaf,0x403aff5a /* 00002080 */
,0x403d08a3,0x403f1798,0x40412c4f,0x404346ce /* 00002090 */
,0x40456729,0x40478d73,0x4049b9be,0x404bec14 /* 000020a0 */
,0x404e248b,0x40506331,0x4052a81d,0x4054f359 /* 000020b0 */
,0x405744fc,0x40599d13,0x405bfbb5,0x405e60f1 /* 000020c0 */
,0x4060cce0,0x40633f8a,0x4065b907,0x40683969 /* 000020d0 */
,0x406ac0c5,0x406d4f2d,0x406fe4b5,0x40728171 /* 000020e0 */
,0x4075257f,0x4077d0e0,0x407a83b1,0x407d3e09 /* 000020f0 */
,0x7f800000,0x00000000,0x7f800001,0x40000000 /* 00002100 */
,0x30800000,0x30000000,0x4f000000,0x4f800000 /* 00002110 */
,0x5f7fffcf,0x7f800001,0x7f800000,0x7f800000 /* 00002120 */
},
};

